www/terraform_configs/82ae7cbd-6903-4ebb-87a8-7a8ecc5441d5/.govmomi/debug/2025-05-30T13-06-11.0989738/1-0003.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><RetrievePropertiesEx xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet><propSet><type>ManagedEntity</type><pathSet>name</pathSet><pathSet>parent</pathSet></propSet><propSet><type>VirtualMachine</type><pathSet>parentVApp</pathSet></propSet><objectSet><obj type="Folder">group-d1</obj><skip>false</skip><selectSet xmlns:XMLSchema-instance="http://www.w3.org/2001/XMLSchema-instance" XMLSchema-instance:type="TraversalSpec"><name>traverseParent</name><type>ManagedEntity</type><path>parent</path><skip>false</skip><selectSet XMLSchema-instance:type="SelectionSpec"><name>traverseParent</name></selectSet></selectSet><selectSet xmlns:XMLSchema-instance="http://www.w3.org/2001/XMLSchema-instance" XMLSchema-instance:type="TraversalSpec"><type>VirtualMachine</type><path>parentVApp</path><skip>false</skip><selectSet XMLSchema-instance:type="SelectionSpec"><name>traverseParent</name></selectSet></selectSet></objectSet></specSet><options></options></RetrievePropertiesEx></Body></Envelope>